const menu=[ //菜单
    {id:1,name:'首页',type:1,url:'./index.html'},
    {id:2,name:'通知公告',type:2,url:'./indexlist.html'},
    {id:3,name:'政策法规',type:3,url:'./indexlist.html'},
    {id:4,name:'新闻资讯',type:4,url:'./indexlist.html'},
    {id:5,name:'特别关注',type:5,url:'./indexlist.html'},
    {id:6,name:'质量信息',type:6,url:'./indexlist.html'},
    {id:7,name:'消费警示',type:7,url:'./indexlist.html'},
    {id:8,name:'企业查询',type:8,url:'./seachall.html'},
]
const newsList=[
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    {id:'1',name:'赵一德在央企进陕项目推进落实专题会议上强调：坚持精准施策 狠抓落地落实 以优质项目建设推动陕西高质量发展'},
    
]
// 获取路由参数
function getQueryVariable() {
    let href = window.location.href
    let query = href.substring(href.indexOf('?')+1);
    let vars = query.split("&");
    let obj = {}
    for (var i = 0; i < vars.length; i++) {
        let pair = vars[i].split("=");
        obj[pair[0]] = pair[1]
    }
    return obj;
}